tap "buo/cask-upgrade"
tap "dbt-labs/dbt"
tap "homebrew/core"
tap "microsoft/git"
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

brew 'sqlite'
brew "git"
brew 'git-plus'
brew "gnu-sed"
brew "jq"
brew "python@3.7"
brew "node", link: false
brew "openssl@3"
brew 'icu4c'
brew 'gcc'
brew 'r'
brew "watchman"
# brew "dbt-labs/dbt/dbt"
brew 'graphviz'
brew 'htop'
brew 'nmap'
brew 'openssl@3'
brew 'ruby-build'
brew 'rbenv'
brew 'tree'
brew 'wget'
# brew 'zsh-completions'
brew 'tldr'
brew 'tree'
brew 'terraform'
brew 'rg'
brew 'fzf' # run /usr/local/opt/fzf/install to finish installation
brew 'jq'
brew 'gh'
brew 'exa' # replacement for ls
brew 'bat' # replacement for cat
brew 'yq'

cask "dbeaver-community"
# cask "google-chrome"
cask 'rstudio'
# cask "slack"
# cask "visual-studio-code"
cask 'alfred'
cask 'iterm2'
# cask 'java'
cask 'ngrok'